//export {addAdditionalInfo, addResearchInfo, addDictAbbreviation, addDictTerm};

export function addAdditionalInfo() {
    return [
        { 
            text: `Приведенные результаты носят исключительно информационный характер и не являются методом 
                диагностики, профилактики или лечения. Сведения о потенциальной эффективности препаратов при 
                данном молекулярном профиле взяты из опубликованных данных (научные статьи, клинические 
                руководства, результаты клинических исследований и т.д.). Онко Генотест отказывается от каких-либо
                заявлений или гарантий относительно опубликованных данных и научной литературы, включая
                информацию и выводы об эффективности/неэффективности терапевтических агентов, которые включены
                или исключены из настоящего отчета. Всю ответственность за принятие итоговых клинических решений по
                терапии несет лечащий врач.`,
            alignment: "justify",
            leadingIndent: 10,
            margin: [0, 0, 0, 10]
        },
        {
            text: `Результаты основаны на секвенировании следующего поколения (NGS) ряда участков для 409 генов 
                (панель Ion AmpliSeq™ Comprehensive Cancer Panel). Варианты, присутствующие в других областях 
                обнаружены не будут. В анализируемых участках также могут находится генетические варианты, которые 
                не детектируются из-за технологических ограничений. Cредняя глубина покрытия для панели Ion  
                AmpliSeq™ Comprehensive Cancer Panel составила 832x. Варианты с глубиной покрытия менее 50х не  
                рассматривали. Координаты обнаруженных генетических вариантов приведены для версии референсного 
                генома hg19. Биоинформатический анализ проводился с помощью программного обеспечения Онко 
                Генотест. По результатам секвенирования не определяли слившиеся гены и хромосомные перестройки, 
                изменения копийности, тандемные дупликации, микросателлитную нестабильность, области потери 
                гетерозиготности, эпигенетические изменения. Большинство вариантов с неизвестной клинической 
                значимостью и генетических полиморфизмов в отчете не указаны и доступны через платформу 
                YourOncoHelp. Классификация обнаруженных вариантов как герминативных/соматических может быть 
                недостоверна. Уровни доказательности сформированы как адаптированые рекомендации AMP/ASCO/CAP. 
                Данные об активных клинических испытаниях взяты с сайта www.clinicaltrials.gov. Указанные 
                клинические испытания могут не подходить для пациента, и врач пациента должен самостоятельно 
                исследовать информацию о клинических испытаниях. Онко Генотест не гарантирует, что какое-либо  
                конкретное клиническое испытание будет эффективным при лечении любого конкретного состояния.`,
            leadingIndent: 10,
            alignment: "justify",
        }

    ]
}

export function addResearchInfo() {
    return [
        { text: "Информация о пациенте", style: "headerInFrame"},

        { text: [
            { text: "Пациент: ", style: "boldText"},
            { text: "Меруерт Омарбекова", style: "text" }
        ], style: "margin"},
        
        { text: [
            { text: "Диагноз при обращении: ", style: "boldText"},
            { text: "Аденокарцинома нижней доли левого  легкого", style: "text"}
        ], style: "margin"},

        { text: [
            { text: "Анамнез: ", style: "boldText"},
            { text: `В декабре 2018 г. произведено МРТ позвоночника, на котором в нижней доле левого легкого визуализировалась тень. В начале января 2019 г. произведена R-графия ОГК, на которой: Признаки кистозного образования, не исключается туберкулез и пневмония. 14.01.2019 г. КТ-картина характерна для округлого образования нижней доли левого легкого S8-S10. 25.01.2019 г. - бронхоскопия с одномоментной трансбронхиальной биопсией из нижней доли левого легкого, заключение: опухолевидный стеноз B6, 9, 10 нижнедолевого бронха левого легкого 2-3 степени за счет инфильтрации слизистой оболочки и сдавление извне с катарально-гнойным эндобронхитом. Заключение биопсии от 25.01.2019 г.: хроническая интерстициальная пневмония. 
            Заключение от 06.02.2019 г. : КТ- признаки susp.cr  нижней доли левого легкого. 19.02.2019 г. произведена операция: торакотоми слева, нижняя лобэктомия легкого с пластикой нижнедолевого бронха, лимфодиссекция.`, style: "text"}
        ], style: "margin"},

        { text: "Информация об образце", style: "headerInFrame"},



        { text: [
            { text: "Тип образца: ", style: "boldText"},
            { text: "парафиновый блок (FFPE)", style: "text"}
        ], style: "margin"},

        { text: [
            { text: "Дата забора образца: ", style: "boldText"},
            { text: "2019.02.19", style: "text"}
        ], style: "margin"},

        { text: [
            { text: "Происхождение образца: ", style: "boldText"},
            { text: "ткани легкого и лимфоузлов, полученные при лобэктомии", style: "text"}
        ], style: "margin"},

        { text: [
            { text: "Доля опухолевых клеток в образце: ", style: "boldText"},
            { text: "90%", style: "text"}
        ], style: "margin"},

        { text: [
            { text: "Гистологический тип: ", style: "boldText"},
            { text: `Инфильтративная низкодифференцированная аденокарцинома легкого, G3, с метастазами в региональные лимфатические узлы. МКБ-10: C34. ICD-O: C342; LUNG & BRONCHUS; 801; CARCINOMA, NOS; 8010/3; Carcinoma, NOS.`,  style: "text"}
        ], style: "margin"},

        { text: [
            { text: "Микрофотография гистологического препарата: ", style: "boldText"},
            { text: "описание того, как происходило окрашивание", style: "text"}
        ], style: "margin"},

        { image: "img/histology.png", width: 534, height: 300, margin: [0, 0, 0, 20]},

        { text: "Состав исследования ONCOMAX ", style: "headerInFrame"},

        { text: "Проведен ряд тестов:", style: "text"},
        {
			ol: [
                {
                    text: 'Иммуногистохимическое исследование материала первичной опухоли',
                    style: "text"
                },
                {
                    text: 'Высокопроизводительное секвенирование ДНК с использованием панели Ion Ion AmpliSeq™ Comprehensive Cancer Panek (409 гена)',
                    style: "text"
                }
            ], 
            margin: [0, 0, 0, 10],
            style: "text",  
        },
        
        { 
            text: `Результаты тестов были обработаны биоинформатиками и проанализированы генетиками и клиническими онкологами с целью нахождения биомаркеров, связанных с потенциальной эффективностью/неэффективностью или токсичностью противоопухолевых препаратов. Интерпретация результатов анализов проведена с учетом актуальных клинических рекомендаций по терапии онкологических заболеваний (NCCN, ESMO, АОР, RUSSCO) и основана на сведениях о клинической значимости обнаруженных биомаркеров, опубликованных в научных статьях, клинических руководствах и результатах клинических исследований. Уровни доказательности сформированы как адаптированные рекомендации AMP/ASCO/CAP.`,
            style: "text",
            leadingIndent: 10,
        },
        { 
            text: `Онко Генотест отказывается от каких-либо заявлений или гарантий относительно опубликованных данных и научной литературы, включая информацию и выводы об эффективности/неэффективности терапевтических агентов, которые включены или исключены из настоящего отчета. Всю ответственность за принятие итоговых клинических решений по терапии несет лечащий врач.`,
            style: "text",
            leadingIndent: 10,
        },
        { 
            text: `Приведенные результаты носят исключительно информационный характер и не являются методом диагностики, лечения или профилактики.`,
            style: "text",
            leadingIndent: 10,
        },
    ]
}

export function addDictTerm() {
    return [
        { 
            text: [
                {
                    text: "Генетический вариант",
                    style: "dictTerm",
                },
                { 
                    text: " - вариант последовательности ДНК, отличающийся от референсной последовательности генома человека.",
                    style: "text",
                    alignment: "justify"
                },
            ],
            style: "margin" 
        },

        { 
            text: [
                {
                    text: "Полиморфизм",
                    style: "dictTerm",
                },
                { 
                    text: ` - генетический вариант, который встречается в популяции чаще чем 1 на 100 индивидуумов (т.е. частота в популяции превышает 1%), и не ассоциирован с фенотипом какого-либо заболевания (не является потенциально патогенным) `,
                    style: "text",
                    alignment: "justify"
                },
            ],
            style: "margin" 
        },

        { 
            text: [
                {
                    text: "Мутация ",
                    style: "dictTerm",
                },
                { 
                    text: " - генетический вариант, который достоверно связан с фенотипом какого-либо заболевания.",
                    style: "text",
                    alignment: "justify"
                },
            ],
            style: "margin" 
        },

        { 
            text: [ 
                "Приведенные выше термины употребляются согласно значениям, принятым Human Genome Variation Society, ",
                { text: "HGVC", link: "http://varnomen.hgvs.org/bg-material/glossary/", decoration: 'underline'},
            ],
            style: "boldText", 
            margin: [0, 7, 0, 0]
        },

        { 
            text: [
                {
                    text: "Аллельная частота",
                    style: "dictTerm",
                },
                { 
                    text: ` - доля данного аллеля в заданном генном локусе. С помощью высокопроизводительного секвенирования аллельная частота оценивается как доля прочтений (reads), несущих аллель. Например, если всего данный сайт покрыт 20 прочтениями, и 8 из них несут интересующий вариант, то аллельная частота составит 8/20=40%. Для герминативного генетического варианта находящимся в гетерозиготном состоянии аллельная частота составляет около 50%. Для герминативного и гомозиготного варианта аллельная частота составляет около 100%. В случае соматических вариантов из- за наличия опухолевой гетерогенности аллельная частота может принимать любые значения в диапазоне 0-100%. `, 
                    style: "text",
                    alignment: "justify"},
            ], 
            style: "margin" 
        },

        { 
            text: [
                {
                    text: "Вариант с неизвестной значимостью",
                    style: "dictTerm",
                },
                { 
                    text: `(англ. “variants of unknown signifcance, VUS”) – в настоящий момент для данного генетического варианта отсутствуют сведения о его терапевтической или прогностической значимости. Однако такие сведения могут быть опубликованы в дальнейшем.`,
                    style: "text",
                    alignment: "justify"},
            ],
            style: "margin"
        },

        { 
            text: [
                {
                    text: "Клинически значимый вариант",
                    style: "dictTerm",
                },
                { 
                    text: ` - генетический вариант, ассоциированный с определенными клинически важными нарушениями функции гена или кодируемого им белка, которые охарактеризованы в научной литературе и других авторитетных источниках. Для данного генетического варианта существуют свидетельства о его прогностической или диагностической ценности.`,
                    style: "text",
                    alignment: "justify"
                },
            ],
            style: "margin" 
        },

        { 
            text: [
                {
                    text: "Уровень доказательности",
                    style: "dictTerm",
                },
                { 
                    text: ` - степень достоверности опубликованных сведений о клинической значимости биомаркера. В настоящем исследовании уровни доказательности сформированы как адаптированные рекомендации AMP/ASCO/CAP. Максимальный уровень доказательности (уровень “A”) соответствует одобрению FDA или рекомендации NCCN, ASCO, ESMO, МинЗдрава, RUSSCO и т.д. Минимальный уровень доказательности (уровень “E”) соответствует вычислительному предсказанию (компьютерному прогнозу) и не подкреплен экспериментальными и клиническими данными.`, 
                    alignment: "justify",
                    style: "text"
                },
            ],
            style: "margin" 
        },

        { 
            text: [
                {
                    text: "Частота в популяции",
                    style: "dictTerm",
                },
                { 
                    text: ` - доля конкретного генетического варианта среди всех имеющихся в популяции. Генетические варианты с высокой популяционной частотой (обычно больше 1%) обычно считаются непатогенными.`,
                    style: "text",
                    alignment: "justify"
                },
            ],
            style: "margin" 
        },
    ]
}

export function addDictAbbreviation() {
    return [
        { 
            text: [
                {
                    text: "ВБП",
                    style: "dictTerm",
                },
                { 
                    text: ` (англ. “progression-free survival, PFS”) – выживаемость без прогрессирования.`,
                    style: "text",
                    alignment: "justify"
                },
            ],
            style: "margin" 
        },

        { 
            text: [
                {
                    text: "ДИ",
                    style: "dictTerm",
                },
                { 
                    text: ` (англ. “confidence interval, CI”) – доверительный интервал, представляет собой числовой интервал с высокой вероятностью (чаще всего 95%) содержащий истинное значение переменной.`,
                    style: "text",
                    alignment: "justify"
                },
            ],
            style: "margin" 
        },

        { 
            text: [
                {
                    text: "НМРЛ",
                    style: "dictTerm",
                },
                { 
                    text: ` - немелкоклеточный рак легкого.`,
                    style: "text",
                    alignment: "justify"
                },
            ],
            style: "margin" 
        },

        { 
            text: [
                {
                    text: "ОВ",
                    style: "dictTerm",
                },
                { 
                    text: ` (англ. “overall survival, OS”) – общая выживаемость.`,
                    style: "text",
                    alignment: "justify"
                },
            ],
            style: "margin" 
        },

        { 
            text: [
                {
                    text: "ОР",
                    style: "dictTerm",
                },
                { 
                    text: ` (англ. “hazard ratio, HR”) – отношение рисков.`,
                    style: "text",
                    alignment: "justify"
                },
            ],
            style: "margin" 
        },

        { 
            text: [
                {
                    text: "FFPE",
                    style: "dictTerm",
                },
                { 
                    text: ` (англ. “Formalin-fixed, Paraffin-embedded”) – образец ткани фиксированный в формалине и заключенный в парафиновые блоки. Качество ДНК, выделенной из FFPE-образцов может повлиять на последующее выполнение генетических анализов.`,
                    style: "text",
                    alignment: "justify"
                },
            ],
            style: "margin" 
        },
        
        { 
            text: [
                {
                    text: "WT",
                    style: "dictTerm",
                },
                { 
                    text: ` (англ. “wild type”) – аллель дикого типа, т.е. данный участок генома не содержит мутаций или вероятно патогенных вариантов.`,
                    style: "text",
                    alignment: "justify"
                },
            ],
            style: "margin" 
        }, 
    ]
}