module.exports = {
    fio: "Демо пациент",
    ogt_id: "OGT-DEMO",
    diagnosis: "Рак легкого",
    report_created: "02.02.2020",
    anamnesis: `Рак легкого обнаружен в 2013 г. Ранее поставленный диагноз - мелкоклеточный рак левого легкого.
                Проведено хирургическое лечение: 2016 г. выполнена верхняя лобэктоия слева с лимфаденэктоией. ПХТ после операци 6 курсов, лучевоое лечение после операции на средостение и профилактически на шейно-надключичные лимфоузлы. 02.03.2018 г. - прогрессирование, метастазирование в левое легкое.
                Клинический диагноз основной: рак легкого T1M2N0 St2 после комбинированного лечения.
                Метастазы в костях, в печени. Состояние после химиолучевой терапии.
                2019 г. - для выполнения молекулярно-генетического тестирования проведена биопсия метастаза, локализованного в ребре.`,
    sample_type: "парафиновый блок (FFPE)",
    sample_date: "01.01.2020",
    sample_origin: "биоптат метастаза в ребре",
    sample_proportion: "90%",
    sample_histology: `Морфологическая картина и иммунофенотип соответствуют метатазам низкодифференцированного неороговевающего плоскоклеточного рака без морфологических и иммуногистохимических признаков органоспецифичности.`  
}